EI2030/Archer/firmware/ec/board/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M33 (Core #0) */
void BOARD_InitPins(void)
{
    /* Enables the clock for the Input Mux.: Enable Clock. */
    CLOCK_EnableClock(kCLOCK_InputMux);
    /* Enables the clock for the I/O controller.: Enable Clock. */
    CLOCK_EnableClock(kCLOCK_Iocon);

    /* Enables the clock for the GPIO0 module */
    CLOCK_EnableClock(kCLOCK_Gpio0);

    /* Enables the clock for the GPIO1 module */
    CLOCK_EnableClock(kCLOCK_Gpio1);

    gpio_pin_config_t KSI0_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_0 (pin 54)  */
    GPIO_PinInit(BOARD_INITPINS_KSI0_GPIO, BOARD_INITPINS_KSI0_PORT, BOARD_INITPINS_KSI0_PIN, &KSI0_config);

    gpio_pin_config_t KSI1_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_1 (pin 7)  */
    GPIO_PinInit(BOARD_INITPINS_KSI1_GPIO, BOARD_INITPINS_KSI1_PORT, BOARD_INITPINS_KSI1_PIN, &KSI1_config);

    gpio_pin_config_t KSI2_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_2 (pin 81)  */
    GPIO_PinInit(BOARD_INITPINS_KSI2_GPIO, BOARD_INITPINS_KSI2_PORT, BOARD_INITPINS_KSI2_PIN, &KSI2_config);

    gpio_pin_config_t KSI3_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_3 (pin 83)  */
    GPIO_PinInit(BOARD_INITPINS_KSI3_GPIO, BOARD_INITPINS_KSI3_PORT, BOARD_INITPINS_KSI3_PIN, &KSI3_config);

    gpio_pin_config_t KSI4_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_4 (pin 86)  */
    GPIO_PinInit(BOARD_INITPINS_KSI4_GPIO, BOARD_INITPINS_KSI4_PORT, BOARD_INITPINS_KSI4_PIN, &KSI4_config);

    gpio_pin_config_t KSI5_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_5 (pin 88)  */
    GPIO_PinInit(BOARD_INITPINS_KSI5_GPIO, BOARD_INITPINS_KSI5_PORT, BOARD_INITPINS_KSI5_PIN, &KSI5_config);

    gpio_pin_config_t KSI6_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_6 (pin 89)  */
    GPIO_PinInit(BOARD_INITPINS_KSI6_GPIO, BOARD_INITPINS_KSI6_PORT, BOARD_INITPINS_KSI6_PIN, &KSI6_config);

    gpio_pin_config_t KSI7_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_7 (pin 6)  */
    GPIO_PinInit(BOARD_INITPINS_KSI7_GPIO, BOARD_INITPINS_KSI7_PORT, BOARD_INITPINS_KSI7_PIN, &KSI7_config);

    gpio_pin_config_t PMIC_STBY_REQ_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_8 (pin 26)  */
    GPIO_PinInit(BOARD_INITPINS_PMIC_STBY_REQ_GPIO, BOARD_INITPINS_PMIC_STBY_REQ_PORT, BOARD_INITPINS_PMIC_STBY_REQ_PIN, &PMIC_STBY_REQ_config);

    gpio_pin_config_t PMIC_ON_REQ_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_9 (pin 55)  */
    GPIO_PinInit(BOARD_INITPINS_PMIC_ON_REQ_GPIO, BOARD_INITPINS_PMIC_ON_REQ_PORT, BOARD_INITPINS_PMIC_ON_REQ_PIN, &PMIC_ON_REQ_config);

    gpio_pin_config_t LED_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_10 (pin 21)  */
    GPIO_PinInit(BOARD_INITPINS_LED_GPIO, BOARD_INITPINS_LED_PORT, BOARD_INITPINS_LED_PIN, &LED_config);

    gpio_pin_config_t MPU_RST_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_15 (pin 22)  */
    GPIO_PinInit(BOARD_INITPINS_MPU_RST_GPIO, BOARD_INITPINS_MPU_RST_PORT, BOARD_INITPINS_MPU_RST_PIN, &MPU_RST_config);

    gpio_pin_config_t KSOS0_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_18 (pin 56)  */
    GPIO_PinInit(BOARD_INITPINS_KSOS0_GPIO, BOARD_INITPINS_KSOS0_PORT, BOARD_INITPINS_KSOS0_PIN, &KSOS0_config);

    gpio_pin_config_t KSOS1_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_19 (pin 90)  */
    GPIO_PinInit(BOARD_INITPINS_KSOS1_GPIO, BOARD_INITPINS_KSOS1_PORT, BOARD_INITPINS_KSOS1_PIN, &KSOS1_config);

    gpio_pin_config_t KSOS2_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_20 (pin 74)  */
    GPIO_PinInit(BOARD_INITPINS_KSOS2_GPIO, BOARD_INITPINS_KSOS2_PORT, BOARD_INITPINS_KSOS2_PIN, &KSOS2_config);

    gpio_pin_config_t KSOS3_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_21 (pin 76)  */
    GPIO_PinInit(BOARD_INITPINS_KSOS3_GPIO, BOARD_INITPINS_KSOS3_PORT, BOARD_INITPINS_KSOS3_PIN, &KSOS3_config);

    gpio_pin_config_t KSOE_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_22 (pin 78)  */
    GPIO_PinInit(BOARD_INITPINS_KSOE_GPIO, BOARD_INITPINS_KSOE_PORT, BOARD_INITPINS_KSOE_PIN, &KSOE_config);

    gpio_pin_config_t SPI_CS_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_23 (pin 20)  */
    GPIO_PinInit(BOARD_INITPINS_SPI_CS_GPIO, BOARD_INITPINS_SPI_CS_PORT, BOARD_INITPINS_SPI_CS_PIN, &SPI_CS_config);

    gpio_pin_config_t SPI_SCLK_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_24 (pin 70)  */
    GPIO_PinInit(BOARD_INITPINS_SPI_SCLK_GPIO, BOARD_INITPINS_SPI_SCLK_PORT, BOARD_INITPINS_SPI_SCLK_PIN, &SPI_SCLK_config);

    gpio_pin_config_t SPI_MOSI_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_25 (pin 79)  */
    GPIO_PinInit(BOARD_INITPINS_SPI_MOSI_GPIO, BOARD_INITPINS_SPI_MOSI_PORT, BOARD_INITPINS_SPI_MOSI_PIN, &SPI_MOSI_config);

    gpio_pin_config_t SPI_MISO_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_26 (pin 60)  */
    GPIO_PinInit(BOARD_INITPINS_SPI_MISO_GPIO, BOARD_INITPINS_SPI_MISO_PORT, BOARD_INITPINS_SPI_MISO_PIN, &SPI_MISO_config);

    gpio_pin_config_t LCD_EN_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_28 (pin 66)  */
    GPIO_PinInit(BOARD_INITPINS_LCD_EN_GPIO, BOARD_INITPINS_LCD_EN_PORT, BOARD_INITPINS_LCD_EN_PIN, &LCD_EN_config);

